In [1]:
import pandas as pd

In [2]:
def generate_data():
    return pd.DataFrame({
        'NOM': ['A ', 'B', 'C'],
        'NUM': [1,2,3],
        'QF': [120, 230, 1240]
    })

In [3]:
df = generate_data()

In [4]:
df

  NOM  NUM    QF
0   A    1   120
1   B    2   230
2   C    3  1240

In [8]:
def filter_data(df):
    return df[df.QF < 450]

In [9]:
result = filter_data(df)

In [10]:
result

  NOM  NUM   QF
0   A    1  120
1   B    2  230

In [11]:
result.to_csv("result.csv")